export const countries = {
  IR: {
    title_fa: 'ایران',
    flag: '/images/countries/48/Iran.png',
    link: '/server/dedicated/iran',
    recommended: false,
    info: 'ایران بهترین مکان برای میزبانی سایت های دولتی و حکومتی است که از حساسیت های زیادی برخوردارند.علاوه بر امنیت اطلاعات شما در سرور های وطنی سرعت بالای انتقال اطلاعات را برای کاربرانتان مهیا میکنید',
    largeInfo: (
      <p>
        استفاده از سرورهای اختصاصی داخل کشور باعث می‌شود که سرعت دسترسی کاربران
        ایرانی به اطلاعات سرور شما تا جندین برابر افزایش پیدا کند. سرور های
        ایرانی سرعت و امنیت را برای آن دسته از کاربرانی که دارای وب سایت با
        بازدید بالا هستند به ارمغان می آورد. سرور اختصاصی ایران مناسب جهت
        میزبانی سازمان ها و ادارات دولتی است.
      </p>
    ),
  },
  FR: {
    title_fa: 'فرانسه',
    flag: '/images/countries/48/France.png',
    link: '/server/dedicated/france',
    recommended: true,
    info: 'فرانسه با سهم بیش از 4 درصد از مراکز داده ی جهان و کیفیت مناسب سرور ها و وضعیت خوب شبکه نسبت به ایران همواره یکی از کاندید های انتخاب ما ایرانیان است',
    largeInfo: (
      <>
        <p>
          <strong>سرور های اختصاصی فرانسه</strong> همانند کشور کانادا از
          دیتاسنتر OVH ارائه می گردد که با دارا بودن جمعا 7.5 ترابیت برثانیه
          پهنای باند، بزرگترین دیتاسنتر تجاری جهان شمرده می شود. سرورهای این
          دیتاسنتر به منظور استفاده به عنوان میزبانی وب سایت، نصب مجازی ساز و
          راه اندازی سرور مجازی و ارسال ایمیل انبوه به دلیل ارائه آی پی با تعداد
          بالا بیشتر مورد استفاده قرار می گیرد.
        </p>
        <p>
          قوانین این دیتاسنتر :<br />
          امکان ارائه آی پی تا 256 عدد بر روی هر سرور
          <br />
          عدم پرداخت هزینه آی پی به صورت ماهانه (یکبار پرداخت)
          <br />
          ارائه دسترسی Rescue به منظور رفع مشکلات احتمالی
          <br />
          عدم ارسال Abuse های متعدد به منظور پیگیری های قانونی (مناسب برای ارسال
          ایمیل)
        </p>
      </>
    ),
  },
  DE: {
    title_fa: 'آلمان',
    flag: '/images/countries/48/Germany.png',
    link: '/server/dedicated/germany',
    recommended: false,
    info: 'شاید از بین کشور های خارجی آلمان بهترین پینگ را نسبت به ایران دارد و این دلیل محبوبیت سرور های این کشور حتی با قیمت های زیاد و سخت افزار های قدیمی است',
    largeInfo: (
      <>
        <p>
          <strong>سرور های اختصاصی آلمان</strong> از دیتاسنتر Hetzner ارائه می
          گردد که یکی از بزرگترین و محبوب ترین دیتاسنترهای اروپا و مورد توجه
          ایرانیان محسوب می گردد این دیتاسنتر به منظور استفاده به عنوان هاست
          اشتراکی و راه اندازی وب سایت با هزینه مقرون به صرفه توجه کاربران
          ایرانی را به خود جلب کرده است. همینطور پینگ مناسب این دیتاسنتر نسبت به
          شبکه ایران باعث میشود تا سرعت بارگذاری وب سایت های میزبانی شده در این
          دیتاسنتر به صورت بسیار مطلوبی افزایش یابد.
        </p>
        <p>
          قوانین این دیتاسنتر :<br />
          امکان خرید آی پی تا 32 عدد
          <br />
          امکان تهیه KVM موقت به مدت 2 ساعت
          <br />
          امکان ارائه پنل اختصاصی ریبوت سرور
        </p>
      </>
    ),
  },
  NL: {
    title_fa: 'هلند',
    flag: '/images/countries/48/Netherlands.png',
    link: '/server/dedicated/netherlands',
    recommended: false,
    info: 'پینگ خوب نسبت به ایران و عدم حساسیت به قوانین کپی رایت ، سرور های هلندی را حتی با قیمت های کمی گرانتر و سخت افزار های قدیمی تر محبوب میکند',
    largeInfo: (
      <>
        <p>
          <strong>سرورهای اختصاصی هلند</strong> از دیتاسنتر Worldstream ارائه می
          گردد که یکی از بزرگترین دیتاسنتر های هلند شمرده می شود این دیتاسنتر به
          منظور استفاده به عنوان نصب مجازی ساز و راه اندازی سرور مجازی به دلیل
          کیفیت بالای پورت و شبکه بیشتر مورد استفاده قرار می گیرد.
        </p>
        <p>
          نقاط مثبت این دیتاسنتر :<br /> ارائه پورت 1 گیگابیت واقعی
          <br />
          استفاده از سخت افزار مرغوب
          <br />
          ارائه دسترسی Rescue به منظور رفع مشکلات احتمالی
          <br />
          قرار دادن فایروال سخت افزاری به صورت رایگان برای هر سرور
        </p>
      </>
    ),
  },
  CA: {
    title_fa: 'کانادا',
    flag: '/images/countries/48/Canada.png',
    link: '/server/dedicated/canada',
    recommended: false,
    info: 'کانادا با دارا بودن زیر ساخت های مخابراتی پیشرفته در حال حاضر 100 دیتاسنتر را در خود جای داده که از تنوع محصولات بسیاری برخوردار است.همچنین اکثر دیتاسنتر های این کشور مشتری را از پرداختن مالیات معاف میکند',
    largeInfo: (
      <>
        <p>
          <strong>سرور اختصاصی کانادا</strong> مانند کشور فرانسه توسط دیتاسنتر
          OVH ارائه می گردد که بزرگترین دیتاسنتر تجاری جهان شمرده می شود.
          سرورهای این دیتاسنتر به منظور استفاده به عنوان میزبانی وب سایت، نصب
          مجازی ساز و راه اندازی سرور مجازی و ارسال ایمیل انبوه به دلیل ارائه آی
          پی با تعداد بالا بیشتر مورد استفاده قرار می گیرد.
        </p>
        <p>
          قوانین این دیتاسنتر :<br />
          امکان ارائه آی پی تا 256 عدد بر روی هر سرور
          <br />
          عدم پرداخت هزینه آی پی به صورت ماهانه (یکبار پرداخت)
          <br />
          ارائه دسترسی Rescue به منظور رفع مشکلات احتمالی
          <br />
          عدم ارسال Abuse های متعدد به منظور پیگیری های قانونی (مناسب برای ارسال
          ایمیل)
        </p>
      </>
    ),
  },
  FI: {
    title_fa: 'فنلاند',
    flag: '/images/countries/48/Finland.png',
    link: '/server/dedicated/finland',
    recommended: false,
    info: 'فنلاند، با زیرساختی قوی و سخت افزار های نو و جدید رقیب سر سخت دیتاسنتر های اروپایی شده و با کاهش قیمت ها برنده تمامی معیار های اقتصادی و فنی شده است.',
    largeInfo: (
      <>
        <p>
          <strong>سرور های اختصاصی فنلاند</strong> از دیتاسنتر جدید Hetzner
          ارائه می&zwnj;شوند که دارای کیفیت زیر ساخت و سخت افزار عالی و قیمت
          ارزانتر از سرور های مشابه در لوکیشن آلمان همان دیتاسنتر هستند. پلن های
          سرور های فنلاند متنوع و با طیف گسترده ای از سخت افزار ها مثل هارد های
          NVMe و پردازشگر های AMD ارائه میشود. پینگ تایم این سرور ها برای
          کاربران ایرانی بسیار مناسب بوده و راه اندازی وب سایت ها و یا مجازی
          سازی این لوکیشن پیشنهاد خواهد شد.
          <br />
          زمان تحویل سرور ها از این دیتاسنتر در روز های کاری ایران و اروپا
          (دوشنبه الی پنجشنبه) کمتر از یک روز کاری خواهد بود و امکان ارائه پنل
          مستقیم دیتاسنتر برای امور فنی نیز فراهم است.
        </p>
        <p>قوانین این دیتاسنتر :</p>
        <ul>
          <li>امکان ارائه آی پی تا 1024 عدد بر روی هر سرور</li>
          <li>امکان تهیه KVM موقت به مدت 2 ساعت</li>
          <li>ارائه دسترسی Rescue به منظور رفع مشکلات احتمالی</li>
          <li>امکان ارائه پنل اختصاصی ریبوت سرور</li>
        </ul>
      </>
    ),
  },
  US: {
    title_fa: 'آمریکا',
    flag: '/images/countries/48/United.States.of.America.USA.png',
    link: '/server/dedicated/usa',
    recommended: false,
    info: 'آمریکا به عنوان بزرگترین کشور میزبانی وب دارای بیش از 1000 دیتاسنتر بوده و تنوع محصولات و قیمت ها بسیار زیاد است و به دلیل قیمت کمتر،سخت افزار جدید و قوی و پهنای بالاتر مشتری های زیادی را به طرف خود کشاندهاست',
    largeInfo: (
      <>
        <p>
          <strong>سرور اختصاصی آمریکا</strong> توسط دیتاسنتر XLHOST از زیرمجموعه
          های شرکت eNET در آمریکا میباشد. این شرکت در سال ۱۹۹۴ تاسیس شده است و
          درحال ارائه خدمات اینترنتی و پهنای باند میباشد. یکی از دلایل موفقیت
          این دیتاسنتر و داشتن کیفیت بسیار بالا آن استفاده از سخت افزار واقعی
          سرور و سرورهای اختصاصی میباشد. این درحالی است که تعدادی بیشماری از
          دیتاسنترهای دیگر دنیا از قطعات بسیار بی کیفیت و یا PC جهت ارائه سرویس
          استفاده میکنند.
        </p>
      </>
    ),
  },
};
