import Link from 'next/link';

type licenses = 'directadmin' | 'cpanel' | 'litespeed' | 'whmcs' | 'cloudlinux';

export const renderPageInfo = (license: licenses) => {
  switch (license) {
    case 'directadmin':
      return (
        <p>
          <span>DA </span>
          دایرکت ادمین که بسیار ساده ، کاربردی و انعطاف پذیر است این روز ها
          مشتریان زیادی در کشورمان ایران پیدا کرده و با نسخه‌های متعددی از
          لینوکس <a>CentOs</a>، <a>Ubuntu</a> و <a>Debian</a> سازگاری کامل دارد.
          دایرکت ادمین اغلب به صورت کوتاه، DA نامیده می‌شود.برای اسفاده از آن بر
          روی{' '}
          <Link href="/server/dedicated">
             سرور اختصاصی 
          </Link>
          و{' '}
          <Link href="/server/vps">
            سرور مجازی
          </Link>{' '}
          نیاز به لایسنس (مجوز استفاده) خواهید داشت که در جی سرور میتونید به دو
          صورت ماهیانه و لایف تایم(همیشگی) این لایسنس رو برای این کنترل پنل شگفت
          انگیز تهیه کنید و از استفاده از آن لذت ببرید{' '}
        </p>
      );
    case 'cpanel':
      return (
        <p>
          <span>CP </span>
          سی پنل را همه میشناسند!سی پنل بسیار پویا و خوش ظاهر است،بسیاری از
          وبمستر ها به دلیل ظاهر آراسته اش به آن علاقمند شدند.سی پنل که محصول یک
          شرکت آمریکایی با همین نام است بر روی سرور های لینوکسی نصب میشود.ابزار
          معروف EasyApache را سال های قبل برای راحت کردن امور فنی ارائه کرد.قیمت
          بالای سی پنل در مقایسه با رقبای خود از جمله{' '}
          <Link href="/licenses/directadmin" title="خرید لایسنس دایرکت ادمین">
            دایرکت ادمین
          </Link>{' '}
          باعث شده تا صرفا کسانی که مایل به میزبانی تعداد زیادی از وب سایت ها
          هستند، به خرید آن اقدام کنند.
          <br />
          سی پنل هماهنگی زیادی با{' '}
          <Link href="/licenses/cloudlinux" title="خرید لایسنس کلاود لینوکس">
            CloudLinux
          </Link>{' '}
          دارد و توسعه دهندگان هر دو پروژه توصیه کردند برای دریافت بیشتری بازدهی
          و امنیت هر دو بر روی سرور نصب شود.
          <br />
          همینطور اگر مایلید سرور شما با تمام توان کار کند و بیشتری بازدهی را
          دریافت کنید وب سرور{' '}
          <Link href="/licenses/litespeed" title="خرید لایسنس لایت اسپید">
            لایت اسپید
          </Link>{' '}
          را فراموش نکنید.{' '}
        </p>
      );
    case 'litespeed':
      return (
        <p className="license-description">
          <span className="dropcast dc-transparent">LS </span>
          وب سرور LiteSpeed ، یک وب سرور با کارایی بالا و مقیاس پذیری بالا هست.
          بطور کامل قابل تعویض با وب سرور آپاچی Apache میباشد ، بنابراین وب سرور
          لایت اسپید می تواند به سرعت در یک تنگنای بزرگی که در بستر وب سرور
          موجود شما ایجاد شده جایگزین شود. با یک بُرد فراگیر در ویژگی ها و سادگی
          استفاده برای مدیریت سرور ، وب سرور لایت اسپید می تواند به شما برای
          بیرون امدن از چالش گسترش معماری یک وب سرور کمک کند. <br />
          وب سرور لایت اسپید در شرایط همزمان سرعت و مقیاس پذیری پایین , کارایی
          بالایی داره. آزمایش های ما ثابت کردن که 6 بار سریع تر از آپاچی عمل می
          کند. وقتی که محتوای ایستا در جریان باشد , شتاب دهنده های محتوای لایت
          اسپید شامل thttpd و boa و TUX خیلی خوب پیشی می گیرند. همچنین وقتی
          محتوا پویا باشد و پردازش PHP مورد بحث باشد ، لایت اسپید بیش از ۵۰%
          سریع تر از زمانی که آپاچی با mod_php عمل می کنه محتوای PHP رو تحویل
          خواهد داد.{' '}
        </p>
      );
    case 'whmcs':
      return (
        <p className="license-description">
          <span className="dropcast dc-transparent">W </span>
          این روز ها که همه به فکر کسب و کار های آنلاین هستند، بسیاری از شرکت
          های میزبانی وب و طراحان وب سایت به دنبال سیستم مدیریت فروشی هستند که
          بسیاری از دغدغه های فنی و پشتیبانی و مالی را از روی دوش آن ها کم
          کند.WHMCS همان سیستمی است که تاکنون در بازار فروش جهانی جای خود را باز
          کرده و خودش یک پا "همه فن حریف" است!درگاه های پرداخت خود را به این
          سیستم معرفی کنید و بگویید که چه محصولاتی را ارائه میکنید، خودش همه ی
          کار ها را انجام میدهد.{' '}
        </p>
      );
    case 'cloudlinux':
      return (
        <p>
          <span>CL </span>
          کلاود لینوکس،اولین توزیع تجاری لینوکس، برای بهبود و کنترل شرایط سرور
          پدید آمده.اکثر مشتریان این توزیع مدیران سرور های میزبانی وب هستند که
          تمایل دارند تا کاربرانشان را در حالت ایزوله جدا از یکدگیر میزبانی
          کنند.
          <br />
          کلاود لینوکس این امکان را صاحبان سرور میدهد تا برای هر کاربر منابع
          دقیقی(مثل رم و پردازشگر) مشخص کنند و درصورت استفاده بی رویه اکانت آن
          کاربر را غیرفعال کند.همینطور کلاود لینوکس قابلیت هایی مثل CageFS و
          تغییر نسخه php را در اختیار مدیران سرور قرار میدهد.{' '}
        </p>
      );
    default:
      return <p></p>;
  }
};
