import * as React from 'react';
import { Col } from 'react-bootstrap';
import Link from 'next/link';
import styles from './HostFaq.module.scss';

export interface HostFaqProps {}

export interface HostFaqState {}

class HostFaq extends React.Component<HostFaqProps, HostFaqState> {
  constructor(props: HostFaqProps) {
    super(props);
    this.state = {};
  }
  render() {
    return (
      <Col>
        <div className={styles.title}>
          <Link href="/hosting/faq">
            <a>
              <h5>سوالات متداول هاست میزبانی</h5>
            </a>
          </Link>
          <div className={styles.divider}>
            <div />
          </div>
        </div>

        <div className={styles.faqBox}>
          <div className={styles.body}>
            <h4 className={styles.question}>
              1 - سرعت و کیفیت هاست اروپا نسبت به هاست ایران چگونه است ؟
            </h4>
            <Col md={10} className={styles.answer}>
              <p>
                کاربران بسیار زیادی قبل از خرید هاست از ما این سوال را پرسیده
                اند و همواره پاسخ ما به کاربران این بوده است که سرویس های اروپا
                به دلیل به روز بودن قطعات سرور ها، از کیفیت و آپتایم بالا و هم
                چنین پهنای باند بسیار بیشتری نسبت به سرویس های ایران برخودار
                هستند .
              </p>
              <p>
                در مقابل سرویس های ایران به دلیل فاصله و موقعیت جفرافیایی نسبت
                به شما و کاربران ایرانی، از سرعت بیشتری نسبت به سرویس های اروپا
                برخوردار هستند .
              </p>
            </Col>
          </div>
        </div>
        <div className={styles.faqBox}>
          <div className={styles.body}>
            <h4 className={styles.question}>
              2 - منظور از پردازنده و میزان آن در سرویس های هاست لینوکس چیست ؟
            </h4>
            <Col md={10} className={styles.answer}>
              <p>
                در واقع هاست قسمتی از یک سرور است، سرور هم مانند کامپیوتر های
                عادی دارای cpu یا همان پردازنده هستند،جی سرور جهت ارائه خدمات
                بهتر به هر پلن مقدار مشخصی پردازنده اختصاص میدهد. درصورتی که به
                تازگی تصمیم به راه اندازی وب سایت گرفته اید و میخواهید سایت
                جدیدی را راه اندازی کنید باید بدانید که میزان پردازنده ای که در
                هاست های میزبانی استاندارد ارائه شده است، برای وب سایت شما تا
                مدت زیادی کافی هستند و تا زمان رشد وب سایت و افزایش تعداد
                بازدیدکنندگان به میزان پردازنده بیشتری نیاز ندارید.
              </p>
            </Col>
          </div>
        </div>
        <div className={styles.faqBox}>
          <div className={styles.body}>
            <h4 className={styles.question}>
              3 - هاست های میزبانی جی سرور از چه تعداد زیر دامین، پارک دامین و
              ادان دامین پشتیبانی می کند ؟
            </h4>
            <Col md={10} className={styles.answer}>
              <p>
                در تمامی پلن های هاست میزبانی ، با کلیک بر روی دکمه "اطلاعات
                بیشتر" در انتهای جدول مقدار دقیق این مشخصات را مشاهده کنید . در
                تمامی پلن های هاست میزبانی جی سرور محدودیتی برای زیر دامنه در
                نظر گرفته نشده .
              </p>
            </Col>
          </div>
        </div>
        <div className={styles.faqBox}>
          <div className={styles.body}>
            <h4 className={styles.question}>
              4 - منظور از تعداد Entry Process چیست و اگر از تعداد آن بیشتر شود،
              چه اتفاقی رخ می دهد ؟
            </h4>
            <Col md={10} className={styles.answer}>
              <p>
                تعداد بازدید های هم زمان و یا به صورت کلی تعداد درخواست های
                همزمان از سمت کاربران به هاست میزبانی و یا تعداد روند هایی که در
                خود هاست تعیین می شود را مشخص میکند . اگر مقدار روند ها و بازدید
                های در لحظه به حد تعیین شده برسد ، تا زمان اتمام یک روند،
                درخواست های جدید در حالت انتظار باقی می مانند. بنابراین اگر شما
                صاحب یک وب سایت پربازدید هستید حتما به میزان Entry Process توجه
                داشته باشید و باتوجه به آن نسبت به انتخاب هاست میزبانی اقدام
                کنید.
              </p>
            </Col>
          </div>
        </div>
        <div className={styles.faqBox}>
          <div className={styles.body}>
            <h4 className={styles.question}>
              5 - منظور از هارد SSD چیست و چه تفاوتی با هارد معمولی دارد ؟
            </h4>
            <Col md={10} className={styles.answer}>
              <p>
                هارد های SSD نسل جدید از هارد های ذخیره سازی اطلاعات هستند، سرعت
                خواندن و و نوشتن اطلاعات در این نوع هارد ها 3 تا 5 برابر بیشتر
                از هارد های معمولی است . سرعت بارگذاری سایت ها در این نوع هارد
                به طبع سریع تر خواهد بود .
              </p>
            </Col>
          </div>
        </div>
        <div className={styles.faqBox}>
          <div className={styles.body}>
            <h4 className={styles.question}>
              6 - آیا شما به صورت رایگان برای من وردپرس یا جوملا بر روی هاست نصب
              می کنید ؟
            </h4>
            <Col md={10} className={styles.answer}>
              <p>
                اگر طرفدار سیستم های مدیریت محتوا هستید ولی همواره در مراحل نصب
                مشکل داشتید و یا اینکه مایل نیستید مراحل نصب را خودتان انجام
                دهید ، میتوانید بعد از تهیه هاست میزبانی در تیکتی در بخش
                پشتیبانی جی سرور عنوان کنید . ما بعد از دریافت درخواست شما ،
                اقدام به نصب سیستم مدیریت محتوا مدنظرتان خواهیم کرد و پس از
                اتمام، اطلاعات را در تیکت ارسال میکنیم .
              </p>
            </Col>
          </div>
        </div>
        <div className={styles.faqBox}>
          <div className={styles.body}>
            <h4 className={styles.question}>
              7 - اطلاعات من تا چه مدت پس از خرید سرویس جدید به جی سرور منتقل می
              شود ؟
            </h4>
            <Col md={10} className={styles.answer}>
              <p>
                در صورتی که قصد انتقال وب سایتتان به سرویس های هاست میزبانی جی
                سرور را دارید ، در صورت تمایل میتوانید اطلاعات سرویس قبلی خود را
                در بخش پشتیبانی و در قالب یک تیکت ارسال کنید تا ما برای شما به
                رایگان و با دقت بالا انتقال اطلاعات را انجام دهیم .
              </p>
              <p>
                در صورتی که کنترل پنل سرویس قبلی با سرویس جدید تهیه شده از جی
                سرور یکسان باشد ، انتقال اطلاعات زمان کوتاهی خواهد بود در غیر
                این صورت زمان بیشتری نیاز خواهد داشت .
              </p>
            </Col>
          </div>
        </div>
        <div className={styles.faqBox}>
          <div className={styles.body}>
            <h4 className={styles.question}>
              8 - هاست های میزبانی جی سرور تا چه تعداد بازدیدکننده را در روز
              پشتیبانی می کنند ؟
            </h4>
            <Col md={10} className={styles.answer}>
              <p>
                جی سرور هیچگونه محدودیتی در تعداد بازدیدکننده در طول روز بر روی
                سرویس های خود اعمال نکرده است و بدون محدودیت است، اما شما باید
                توجه داشته باشید که تعداد بازدید در لحظه بر روی پلن های جی سرور
                محدود شده است و برای انتخاب هاست مناسب میبایست تعداد بازدید در
                لحظه وب سایت خود را مشخص کنید و سپس نسبت به خرید هاست مورد نظر
                خود اقدام کنید.
              </p>
            </Col>
          </div>
        </div>
        <div>
          <Col>
            <Link href="/hosting/faq#hostingfaq-contact">
              <a className={styles.moreQLink}>هنوز سوالی دارید‌؟ بپرسید !</a>
            </Link>
          </Col>
        </div>
      </Col>
    );
  }
}

export default HostFaq;
